app/Controllers/Users.php

    public function index()
    {
        // Intento 1 Funcional
        $user = new User();
        $data['users'] = $user->orderBy('idUser','ASC')->findAll();
---
SELECT *
FROM `User`
ORDER BY `idUser` ASC