app/Models/FormatModel.php

    public function ListFormats($idFormat)
    {
        $this->select('idFormat', 'formatName', 'state');
        $this->from('Format');
        $this->where('idFormat',$idFormat);
        $this->get();
---
SELECT *
FROM `Format`