app/Models/ProductTypeModel.php

    public function readProductsType()
    {
        return $this->findAll();
---
SELECT *
FROM `ProductType`