app/Models/ProductModel.php

    public function SelectProducts(){

        $builder = $this->db->table('Product');
        $query = $builder->select('*');
        $query = $builder->get();
---
SELECT *
FROM `Product`

    public function InsertProduct($data)
    {
        $builder = $this->db->table('Product');

        $data = [
            'productName' => $data['productName'],
            'idProductType' => 1,
            'idFormat' => 3
        ];

        $query = $builder->insert($data);
---
INSERT INTO `Product` (`productName`, `idProductType`, `idFormat`) VALUES ('Perno', 1, 3)