app/Models/ProviderModel.php

    public function readProviders()
    {
        return $this->findAll();
---
SELECT *
FROM `Provider`